NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A110F1536GM48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCDC_NS</name>
      <version>2</version>
      <description>DCDC_NS Registers</description>
      <baseAddress>0x50094000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>IPVERSION</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IPVERSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x800001F1</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>DCDC/Bypass Mode Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>DCDC is OFF, bypass switch is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCDCREGULATION</name>
                  <description>Request DCDC regulation, bypass switch disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPKTMAXCTRL</name>
              <description>Ton_max timeout control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM01CTRL0</name>
          <description>EM01 Configurations</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000109</resetValue>
          <resetMask>0x0000030F</resetMask>
          <fields>
            <field>
              <name>IPKVAL</name>
              <description>EM01 Peak Current Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Load36mA</name>
                  <description>Ipeak = 90mA, IL = 36mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load40mA</name>
                  <description>Ipeak = 100mA, IL = 40mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load44mA</name>
                  <description>Ipeak = 110mA, IL = 44mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load48mA</name>
                  <description>Ipeak = 120mA, IL = 48mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load52mA</name>
                  <description>Ipeak = 130mA, IL = 52mA</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load56mA</name>
                  <description>Ipeak = 140mA, IL = 56mA</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load60mA</name>
                  <description>Ipeak = 150mA, IL = 60mA</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSPEED</name>
              <description>EM01 Drive Speed Setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEST_EMI</name>
                  <description>Lowest Efficiency, Lowest EMI.. Small decrease in efficiency from default setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT_SETTING</name>
                  <description>Default Efficiency, Acceptable EMI level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE</name>
                  <description>Small increase in efficiency from the default setting</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEST_EFFICIENCY</name>
                  <description>Highest Efficiency, Highest EMI.. Small increase in efficiency from INTERMEDIATE setting</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23CTRL0</name>
          <description>EM23 Configurations</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000103</resetValue>
          <resetMask>0x0000030F</resetMask>
          <fields>
            <field>
              <name>IPKVAL</name>
              <description>EM23 Peak Current Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Load36mA</name>
                  <description>Ipeak = 90mA, IL = 36mA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load40mA</name>
                  <description>Ipeak = 100mA, IL = 40mA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load44mA</name>
                  <description>Ipeak = 110mA, IL = 44mA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load48mA</name>
                  <description>Ipeak = 120mA, IL = 48mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load52mA</name>
                  <description>Ipeak = 130mA, IL = 52mA</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load56mA</name>
                  <description>Ipeak = 140mA, IL = 56mA</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Load60mA</name>
                  <description>Ipeak = 150mA, IL = 60mA</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSPEED</name>
              <description>EM23 Drive Speed Setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEST_EMI</name>
                  <description>Lowest Efficiency, Lowest EMI.. Small decrease in efficiency from default setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT_SETTING</name>
                  <description>Default Efficiency, Acceptable EMI level</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMEDIATE</name>
                  <description>Small increase in efficiency from the default setting</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEST_EFFICIENCY</name>
                  <description>Highest Efficiency, Highest EMI.. Small increase in efficiency from INTERMEDIATE setting</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PFMXCTRL</name>
          <description>PFMX Control Register</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000B0C</resetValue>
          <resetMask>0x00001F0F</resetMask>
          <fields>
            <field>
              <name>IPKVAL</name>
              <description>PFMX mode Peak Current Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPKTMAXCTRL</name>
              <description>Ton_max timeout control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>BYPSW</name>
              <description>Bypass Switch Enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WARM</name>
              <description>DCDC Warmup Time Done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>DCDC Running</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINLOW</name>
              <description>VREGIN below threshold</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINHIGH</name>
              <description>VREGIN above threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATION</name>
              <description>DCDC in regulation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMAX</name>
              <description>Ton_max Timeout Reached</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4ERR</name>
              <description>EM4 Entry Request Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFMXMODE</name>
              <description>Entered PFMX mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>BYPSW</name>
              <description>Bypass Switch Enabled Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WARM</name>
              <description>DCDC Warmup Time Done Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>DCDC Running Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINLOW</name>
              <description>VREGIN below threshold Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREGINHIGH</name>
              <description>VREGIN above threshold Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATION</name>
              <description>DCDC in Regulation Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMAX</name>
              <description>Ton_max Timeout Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4ERR</name>
              <description>EM4 Entry Req Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFMXMODE</name>
              <description>PFMX Mode Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>DCDC Status Register</description>
          <addressOffset>0x030</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000071F</resetMask>
          <fields>
            <field>
              <name>BYPSW</name>
              <description>Bypass Switch is currently enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WARM</name>
              <description>DCDC Warmup Done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>DCDC is running</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGIN</name>
              <description>VREGIN comparator status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BYPCMPOUT</name>
              <description>Bypass Comparator Output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PFMXMODE</name>
              <description>DCDC in PFMX mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Syncbusy Status Register</description>
          <addressOffset>0x034</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CTRL</name>
              <description>CTRL Sync Busy Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EM01CTRL0</name>
              <description>EM01CTRL0 Sync Busy Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EM01CTRL1</name>
              <description>EM01CTRL1 Sync Bust Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EM23CTRL0</name>
              <description>EM23CTRL0 Sync Busy Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PFMXCTRL</name>
              <description>PFMXCTRL Sync Busy Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Configuration Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKKEY</name>
                  <description></description>
                  <value>43981</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>Unlocked State</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>LOCKED STATE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
